<?xml version="1.0" ?>
<net name="flower_ir" version="11">
	<layers>
		<layer id="0" name="sequential_2_input" type="Parameter" version="opset1">
			<data shape="1,180,180,3" element_type="f32"/>
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,sequential_2_input,sequential_2_input:0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>180</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="sequential_2_input/Transpose([0 3 1 2])/value7161217" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="sequential_2_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>180</dim>
					<dim>180</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_919_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="32" size="864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_919" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential_4/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_6/Conv2D:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential_4/conv2d_6/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="896" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential_4/conv2d_6/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_6/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential_4/conv2d_6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_6/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential_4/conv2d_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_6/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential_4/max_pooling2d_6/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/max_pooling2d_6/MaxPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential_4/conv2d_7/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="928" size="9216"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential_4/conv2d_7/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_7/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential_4/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_7/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential_4/conv2d_7/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="10144" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential_4/conv2d_7/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_7/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential_4/conv2d_7/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_7/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential_4/conv2d_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_7/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential_4/max_pooling2d_7/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/max_pooling2d_7/MaxPool:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential_4/conv2d_8/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="10208" size="36864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential_4/conv2d_8/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_8/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential_4/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_8/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential_4/conv2d_8/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="47072" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential_4/conv2d_8/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_8/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential_4/conv2d_8/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_8/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential_4/conv2d_8/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/conv2d_8/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential_4/max_pooling2d_8/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential_4/max_pooling2d_8/MaxPool/Transpose/value6841208" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="47200" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential_4/max_pooling2d_8/MaxPool/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/dropout_1/Identity:0,StatefulPartitionedCall/sequential_4/max_pooling2d_8/MaxPool:0">
					<dim>1</dim>
					<dim>22</dim>
					<dim>22</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential_4/flatten_2/Const" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="47232" size="16"/>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/sequential_4/flatten_2/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/sequential_4/flatten_2/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>22</dim>
					<dim>22</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/flatten_2/Reshape:0">
					<dim>1</dim>
					<dim>30976</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/sequential_4/dense_4/MatMul/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 30976" offset="47248" size="7929856"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>30976</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/sequential_4/dense_4/MatMul/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>30976</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_4/MatMul/ReadVariableOp:0">
					<dim>128</dim>
					<dim>30976</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/sequential_4/dense_4/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30976</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>30976</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_4/MatMul:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/sequential_4/dense_4/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="7977104" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/sequential_4/dense_4/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_4/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/sequential_4/dense_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_4/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/sequential_4/dense_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_4/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/sequential_4/dense_5/MatMul/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="5, 128" offset="7977360" size="1280"/>
			<output>
				<port id="0" precision="FP16">
					<dim>5</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/sequential_4/dense_5/MatMul/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>5</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_5/MatMul/ReadVariableOp:0">
					<dim>5</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/sequential_4/dense_5/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_5/MatMul:0">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/sequential_4/dense_5/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 5" offset="7978640" size="10"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/sequential_4/dense_5/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_4/dense_5/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/sequential_4/dense_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/output/_11:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/sequential_4/dense_5/BiasAdd:0">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Func/StatefulPartitionedCall/output/_11:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="5" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1"/>
		<edge from-layer="33" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="34" from-port="0" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="40" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="39" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="43" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="43" to-port="1"/>
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.3.0-000-1d18a7679b0"/>
		<Runtime_version value="2022.3.0-000-1d18a7679b0"/>
		<legacy_path value="True"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="['/Users/chepe/hackerdojo/pythonista/hackerdojo-pythonistas/session_3/openvino_notebooks']"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,180,180,3]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<layout value="()"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<model_name value="flower_ir"/>
			<output_dir value="DIR"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="True"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, finegrain_fusing, framework, freeze_placeholder_with_value, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
